# Pandas 1

Pandas is a Python packages with a number of data analysis tools. Its Series and DataFrame data structures provides way to represent data for data analysis.

In [52]:
# import libraries into the environment

import pandas as pd
import numpy as np
import pandas as pd

### Pandas Series

A series is a one-dimensional array.  It is possible to change the value but not the size of the series.

In [53]:
series1 = pd.Series([10, 20, 30])

# first column - indexes of the elements
# second column - the elements
print(series1)

0    10
1    20
2    30
dtype: int64

Create a Pandas Series data structure from NumPy array.

In [54]:
names = np.array(['John', 'Mary', 'James', 'Lisa'])
s2 = pd.Series(names)

print(s2)

0     John
1     Mary
2    James
3     Lisa
dtype: object

### Pandas DataFrame

A Pandas Dataframe resembles a 2D table, with columns and rows.

Here, the 'Name', 'Age' and 'PhoneNumber' are the column-names of the DataFrame.

In [55]:
df = pd.DataFrame ({
    "Name": ['John', 'Mary', 'James', 'Lisa'],
    "Age" : [21, 25, 26, 28],
    "PhoneNumber" : ['65160001', '65160002', '65160003', '65160004']
})

print(df)           # prints values in DataFrame
print(df.dtypes)    # prints data-types of variables

    Name  Age PhoneNumber
0   John   21    65160001
1   Mary   25    65160002
2  James   26    65160003
3   Lisa   28    65160004
Name           object
Age             int64
PhoneNumber    object
dtype: object

In [56]:
# Python List
numList = [1, 2, 3, 4]

# construct a Pandas DataFrame from a Python List.
df = pd.DataFrame(numList)

# print out values in DataFrame
# as the column-names or index-names are not provided,
# default ones are given, which starts from 0.
df

   0
0  1
1  2
2  3
3  4

Printing out the data-type for each of the variable in the DataFrame.

In [57]:
print(df.dtypes)

0    int64
dtype: object

In [66]:
names = [['John', 7000], ['Mary', 3000], ['James', 6000], ['Lisa', 8000]]
    
df2 = pd.DataFrame(names, columns =['Name', 'Salary'])    # set the datatype (Age) to float

print(df2)
print(df2.dtypes)

    Name  Salary
0   John    7000
1   Mary    3000
2  James    6000
3   Lisa    8000
Name      object
Salary     int64
dtype: object

Summary Statistics of the data in the DataFrame.

In [67]:
df2.describe()

            Salary
count     4.000000
mean   6000.000000
std    2160.246899
min    3000.000000
25%    5250.000000
50%    6500.000000
75%    7250.000000
max    8000.000000

In [68]:
# specifying the name of a variable in a Jupyter notebook prints the variable's value.
df2

    Name  Salary
0   John    7000
1   Mary    3000
2  James    6000
3   Lisa    8000

### Reading and Writing Files in Pandas

Specifying a file-path for use for later Code cells.

In [69]:
path = '../dataset/Person.csv'

Using Pandas to write a file with header - a header is the first line of a CSV file that contains all the column-names.

In [70]:
# set header=False if a header is not needed.
df2.to_csv(path, index=False, header=True)

Using Pandas to read a File.

In [71]:
df2 = pd.read_csv(path)  

df2

    Name  Salary
0   John    7000
1   Mary    3000
2  James    6000
3   Lisa    8000

Using Pandas to read a File, but replace its header.

In [77]:
df2 = pd.read_csv(path, header=0, names=['Names', 'Salaries'])  # read file with header

df2

   Names  Salaries
0   John      7000
1   Mary      3000
2  James      6000
3   Lisa      8000

Getting the maximum value for a column.

In [79]:
max_value = df2.Salaries.max()            # get max value for the column

df2['Names'][df2.Salaries == max_value]

3    Lisa
Name: Names, dtype: object

Returns a Pandas Series by querying for a column-name.

In [81]:
df2.Names       # display column

0     John
1     Mary
2    James
3     Lisa
Name: Names, dtype: object

Another notation to return a Pandas Series by giving the column-name.

In [82]:
df2['Names']

0     John
1     Mary
2    James
3     Lisa
Name: Names, dtype: object

Check the data-types for all columns in a DataFrame.

In [84]:
df2.dtypes

Names       object
Salaries     int64
dtype: object

Check the data-type for a particular column in a DataFrame.

In [87]:
df2.Salaries.dtype

dtype('int64')

# Simple functions for data manipulations

In [90]:
df2['Salaries']

0    7000
1    3000
2    6000
3    8000
Name: Salaries, dtype: int64

Getting the average salary.

In [95]:
df2['Salaries'].mean()  # get average

6000.0

Getting the max salary.

In [97]:
df2['Salaries'].max()

8000

Sorting by descending order and displaying the top 2 rows.

In [99]:
Sorted = df2.sort_values(['Salaries'], ascending=False)
Sorted.head(2)  # top sa salaried person

  Names  Salaries
3  Lisa      8000
0  John      7000